In [1]:
import sqlite3
import pandas as pd

# K·∫øt n·ªëi ƒë·∫øn SQLite
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

# T·∫°o b·∫£ng student
cursor.execute("""
CREATE TABLE IF NOT EXISTS student (
    student_id INTEGER PRIMARY KEY,
    name TEXT,
    class TEXT,
    course_id INTEGER,
    score REAL
);
""")

# T·∫°o b·∫£ng course
cursor.execute("""
CREATE TABLE IF NOT EXISTS course (
    id INTEGER PRIMARY KEY,
    course_name TEXT
);
""")

# X√≥a d·ªØ li·ªáu c≈© n·∫øu c√≥
cursor.execute("DELETE FROM student;")
cursor.execute("DELETE FROM course;")

# Ch√®n d·ªØ li·ªáu v√†o b·∫£ng course
cursor.executemany("""
INSERT INTO course (id, course_name) VALUES (?, ?);
""", [(12, 'Giai tich'), (34, 'Thong ke'), (26, 'Tin hoc')])

# Ch√®n d·ªØ li·ªáu v√†o b·∫£ng student
cursor.executemany("""
INSERT INTO student (student_id, name, class, course_id, score) VALUES (?, ?, ?, ?, ?);
""", [
    (1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7),
    (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2),
    (3, 'Pham Van Nam', 'Toan Tin', None, 7.9),
    (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2),
    (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0),
    (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5),
    (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2),
    (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8),
    (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2),
    (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0)
])
conn.commit()

# ƒê√≥ng k·∫øt n·ªëi
conn.close()

In [14]:

# üîπ K·∫øt n·ªëi ƒë·∫øn SQLite
conn = sqlite3.connect("school.db")

# üîπ ƒê·ªçc d·ªØ li·ªáu t·ª´ SQLite v√†o Pandas
df_student = pd.read_sql("SELECT * FROM student;", conn)
df_course = pd.read_sql("SELECT * FROM course;", conn)

# üîπ INNER JOIN (ch·ªâ gi·ªØ nh·ªØng d√≤ng c√≥ kh√≥a kh·ªõp)
df_inner = df_student.merge(df_course, how="inner", left_on="course_id", right_on="id")

# üîπ LEFT JOIN (gi·ªØ t·∫•t c·∫£ sinh vi√™n, n·∫øu kh√¥ng c√≥ kh√≥a kh·ªõp th√¨ course_name s·∫Ω l√† NaN)
df_left = df_student.merge(df_course, how="left", left_on="course_id", right_on="id")

# üîπ RIGHT JOIN (gi·ªØ t·∫•t c·∫£ kh√≥a h·ªçc, n·∫øu kh√¥ng c√≥ kh√≥a kh·ªõp th√¨ student s·∫Ω l√† NaN)
df_right = df_student.merge(df_course, how="right", left_on="course_id", right_on="id")

# üîπ FULL OUTER JOIN (k·∫øt h·ª£p LEFT v√† RIGHT JOIN)
df_full = df_student.merge(df_course, how="outer", left_on="course_id", right_on="id")
# üîπ ƒê√≥ng k·∫øt n·ªëi SQLite
conn.close()

# üîπ In k·∫øt qu·∫£
print("\n INNER JOIN:")
print(df_inner)

print("\n LEFT JOIN:")
print(df_left)

print("\n RIGHT JOIN:")
print(df_right)

print("\n FULL OUTER JOIN:")
print(df_full)

 INNER JOIN:
   student_id               name     class  course_id  score graduation_date  \
0           1  Nguyen Minh Hoang  May Tinh         12    6.7      2025-09-12
1           2       Tran Thi Lan   Kinh Te         34    9.2      2025-06-12
2           3       Pham Van Nam  Toan Tin         34    7.9      2025-09-12
3           7      Bui Tien Dung   Kinh Te         34    9.2      2025-06-12
4           9     Duong Huu Phuc   Kinh Te         34    7.2      2025-09-12
5          10       Cao Thi Hanh  May Tinh         34    7.0      2025-09-12

   id course_name
0  12   Giai tich
1  34    Thong ke
2  34    Thong ke
3  34    Thong ke
4  34    Thong ke
5  34    Thong ke

 LEFT JOIN:
   student_id               name     class  course_id  score graduation_date  \
0           1  Nguyen Minh Hoang  May Tinh         12    6.7      2025-09-12
1           2       Tran Thi Lan   Kinh Te         34    9.2      2025-06-12
2           3       Pham Van Nam  Toan Tin         34    7.9      2025-09-12
3           7      Bui Tien Dung   Kinh Te         34    9.2      2025-06-12
4           9     Duong Huu Phuc   Kinh Te         34    7.2      2025-09-12
5          10       Cao Thi Hanh  May Tinh         34    7.0      2025-09-12

   id course_name
0  12   Giai tich
1  34    Thong ke
2  34    Thong ke
3  34    Thong ke
4  34    Thong ke
5  34    Thong ke

 RIGHT JOIN:
   student_id               name     class  course_id  score graduation_date  \
0         1.0  Nguyen Minh Hoang  May Tinh       12.0    6.7      2025-09-12
1         NaN                NaN       NaN        NaN    NaN             NaN
2         2.0       Tran Thi Lan   Kinh Te       34.0    9.2      2025-06-12
3         3.0       Pham Van Nam  Toan Tin       34.0    7.9      2025-09-12
4         7.0      Bui Tien Dung   Kinh Te       34.0    9.2      2025-06-12
5         9.0     Duong Huu Phuc   Kinh Te       34.0    7.2      2025-09-12
6        10.0       Cao Thi Hanh  May Tinh       34.0    7.0      2025-09-12

   id course_name
0  12   Giai tich
1  26     Tin hoc
2  34    Thong ke
3  34    Thong ke
4  34    Thong ke
5  34    Thong ke
6  34    Thong ke

 FULL OUTER JOIN:
   student_id               name     class  course_id  score graduation_date  \
0         1.0  Nguyen Minh Hoang  May Tinh       12.0    6.7      2025-09-12
1         2.0       Tran Thi Lan   Kinh Te       34.0    9.2      2025-06-12
2         3.0       Pham Van Nam  Toan Tin       34.0    7.9      2025-09-12
3         7.0      Bui Tien Dung   Kinh Te       34.0    9.2      2025-06-12
4         9.0     Duong Huu Phuc   Kinh Te       34.0    7.2      2025-09-12
5        10.0       Cao Thi Hanh  May Tinh       34.0    7.0      2025-09-12
6         NaN                NaN       NaN        NaN    NaN             NaN

   id course_name
0  12   Giai tich
1  34    Thong ke
2  34    Thong ke
3  34    Thong ke
4  34    Thong ke
5  34    Thong ke
6  26     Tin hoc

In [13]:

print("\n RIGHT JOIN:")
print(df_right)

print("\n FULL OUTER JOIN:")
print(df_full)

 RIGHT JOIN:
   student_id               name     class  course_id  score  id course_name
0         1.0  Nguyen Minh Hoang  May Tinh       12.0    6.7  12   Giai tich
1         NaN                NaN       NaN        NaN    NaN  26     Tin hoc
2         2.0       Tran Thi Lan   Kinh Te       34.0    9.2  34    Thong ke
3         7.0      Bui Tien Dung   Kinh Te       34.0    9.2  34    Thong ke

 FULL OUTER JOIN:
    student_id               name     class  course_id  score    id  \
0          1.0  Nguyen Minh Hoang  May Tinh       12.0    6.7  12.0
1          2.0       Tran Thi Lan   Kinh Te       34.0    9.2  34.0
2          7.0      Bui Tien Dung   Kinh Te       34.0    9.2  34.0
3          3.0       Pham Van Nam  Toan Tin        NaN    7.9   NaN
4          9.0     Duong Huu Phuc   Kinh Te        NaN    7.2   NaN
5         10.0       Cao Thi Hanh  May Tinh        NaN    7.0   NaN
6          4.0     Le Thanh Huyen  Toan Tin       20.0    7.2   NaN
7          8.0        Ho Ngoc Mai  Toan Tin       20.0    8.8   NaN
8          5.0        Vu Quoc Anh  May Tinh       24.0    8.0   NaN
9          6.0     Dang Thuy Linh  May Tinh       24.0    5.5   NaN
10         NaN                NaN       NaN        NaN    NaN  26.0

   course_name
0    Giai tich
1     Thong ke
2     Thong ke
3          NaN
4          NaN
5          NaN
6          NaN
7          NaN
8          NaN
9          NaN
10     Tin hoc

### 2. H√£y c·∫≠p nh·∫≠t nh·ªØng gi√° tr·ªã course_id c√≤n thi·∫øu trong b·∫£ng student b·∫±ng c√¢u l·ªánh SQL,
trong ƒë√≥ c√°c gi√° tr·ªã ƒë∆∞·ª£c ƒëi·ªÅn l√† nh·ªØng gi√° tr·ªã n·∫±m trong b·∫£ng course v√† lo·∫°i b·ªè nh·ªØng
b·∫£n ghi tham gia nh·ªØng m√¥n h·ªçc kh√¥ng t·ªìn t·∫°i b·∫£ng course. Sau ƒë√≥ h√£y cho bi·∫øt:
- a. T·ªïng s·ªë sinh vi√™n, ƒëi·ªÉm trung b√¨nh c·ªßa t·ª´ng l·ªõp.
- b. T·ªïng s·ªë sinh vi√™n, ƒëi·ªÉm trung b√¨nh c·ªßa t·ª´ng m√¥n h·ªçc.
- c. Ph√¢n lo·∫°i thi ƒëua theo s·ªë ƒëi·ªÉm c·ªßa t·ª´ng m√¥n h·ªçc bi·∫øt:
- i. ƒêi·ªÉm TB ‚â• 9.0: Xu·∫•t s·∫Øc.
- ii. 6.0 ‚â§ ƒêi·ªÉm TB ‚â§ 8.9: T·ªët.
- iii. ƒêi·ªÉm TB < 6.0: K√©m.

In [16]:
import sqlite3
import pandas as pd

# K·∫øt n·ªëi ƒë·∫øn SQLite
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

#  C·∫≠p nh·∫≠t course_id b·ªã thi·∫øu b·∫±ng gi√° tr·ªã h·ª£p l·ªá t·ª´ b·∫£ng course
cursor.execute("""
    UPDATE student
    SET course_id = (
        SELECT id FROM course ORDER BY RANDOM() LIMIT 1
    )
    WHERE course_id IS NULL;
""")

#  Lo·∫°i b·ªè sinh vi√™n c√≥ course_id kh√¥ng t·ªìn t·∫°i trong b·∫£ng course
cursor.execute("""
    DELETE FROM student WHERE course_id NOT IN (SELECT id FROM course);
""")

conn.commit()  # L∆∞u thay ƒë·ªïi v√†o database

# Hi·ªÉn th·ªã danh s√°ch t·∫•t c·∫£ sinh vi√™n k√®m th√¥ng tin m√¥n h·ªçc
query_students = """
    SELECT student.student_id, student.name, student.class, 
           student.score, course.course_name
    FROM student
    LEFT JOIN course ON student.course_id = course.id;
"""
df_students = pd.read_sql(query_students, conn)
print("Danh s√°ch t·∫•t c·∫£ sinh vi√™n:")
print(df_students)

#  Truy v·∫•n t·ªïng s·ªë sinh vi√™n v√† ƒëi·ªÉm trung b√¨nh theo t·ª´ng l·ªõp
query_class = """
    SELECT class, COUNT(*) AS total_students, ROUND(AVG(score), 2) AS avg_score
    FROM student
    GROUP BY class;
"""
df_class = pd.read_sql(query_class, conn)
print("\n T·ªïng s·ªë sinh vi√™n v√† ƒëi·ªÉm trung b√¨nh c·ªßa t·ª´ng l·ªõp:")
print(df_class)

#  Truy v·∫•n t·ªïng s·ªë sinh vi√™n v√† ƒëi·ªÉm trung b√¨nh theo t·ª´ng m√¥n h·ªçc
query_course = """
    SELECT course.course_name, COUNT(student.student_id) AS total_students, 
           ROUND(AVG(student.score), 2) AS avg_score
    FROM student
    JOIN course ON student.course_id = course.id
    GROUP BY course.course_name;
"""
df_course = pd.read_sql(query_course, conn)
print("\n T·ªïng s·ªë sinh vi√™n v√† ƒëi·ªÉm trung b√¨nh c·ªßa t·ª´ng m√¥n h·ªçc:")
print(df_course)

#  Ph√¢n lo·∫°i thi ƒëua theo ƒëi·ªÉm trung b√¨nh c·ªßa t·ª´ng m√¥n h·ªçc
query_performance = """
    SELECT course.course_name, COUNT(student.student_id) AS total_students, 
        ROUND(AVG(student.score), 2) AS avg_score,
        CASE 
            WHEN AVG(student.score) >= 9.0 THEN 'Xu·∫•t s·∫Øc'
            WHEN AVG(student.score) BETWEEN 6.0 AND 8.9 THEN 'T·ªët'
            ELSE 'K√©m'
        END AS performance
    FROM student
    JOIN course ON student.course_id = course.id
    GROUP BY course.course_name;
"""
df_performance = pd.read_sql(query_performance, conn)
print("\n Ph√¢n lo·∫°i thi ƒëua theo s·ªë ƒëi·ªÉm c·ªßa t·ª´ng m√¥n h·ªçc:")
print(df_performance)

# ƒê√≥ng k·∫øt n·ªëi
conn.close()

Danh s√°ch t·∫•t c·∫£ sinh vi√™n:
   student_id               name     class  score course_name
0           1  Nguyen Minh Hoang  May Tinh    6.7   Giai tich
1           2       Tran Thi Lan   Kinh Te    9.2    Thong ke
2           3       Pham Van Nam  Toan Tin    7.9    Thong ke
3           7      Bui Tien Dung   Kinh Te    9.2    Thong ke
4           9     Duong Huu Phuc   Kinh Te    7.2    Thong ke
5          10       Cao Thi Hanh  May Tinh    7.0    Thong ke

 T·ªïng s·ªë sinh vi√™n v√† ƒëi·ªÉm trung b√¨nh c·ªßa t·ª´ng l·ªõp:
      class  total_students  avg_score
0   Kinh Te               3       8.53
1  May Tinh               2       6.85
2  Toan Tin               1       7.90

 T·ªïng s·ªë sinh vi√™n v√† ƒëi·ªÉm trung b√¨nh c·ªßa t·ª´ng m√¥n h·ªçc:
  course_name  total_students  avg_score
0   Giai tich               1        6.7
1    Thong ke               5        8.1

 Ph√¢n lo·∫°i thi ƒëua theo s·ªë ƒëi·ªÉm c·ªßa t·ª´ng m√¥n h·ªçc:
  course_name  total_students  avg_score performance
0   Giai tich               1        6.7         T·ªët
1    Thong ke               5        8.1         T·ªët

### 3. H√£y x·∫øp h·∫°ng sinh vi√™n th√¥ng qua:
- a. ƒêi·ªÉm s·ªë.
- b. ƒêi·ªÉm s·ªë theo l·ªõp h·ªçc.
- c. ƒêi·ªÉm s·ªë theo m√£ m√¥n h·ªçc.
- v√† cho bi·∫øt top 3 sinh vi·ªán ƒë·∫°t th·ª© h·∫°ng cao nh·∫•t, top 3 sinh vi√™n ƒë·∫°t th·ª© h·∫°ng th·∫•p nh·∫•t theo
t·ª´ng tr∆∞·ªùng h·ª£p tr√™n.

In [ ]:
import sqlite3
import pandas as pd

# K·∫øt n·ªëi SQLite
conn = sqlite3.connect("school.db")

#  X·∫øp h·∫°ng sinh vi√™n theo ƒëi·ªÉm s·ªë to√†n b·ªô
query_rank_overall = """
    SELECT student_id, name, class, course_id, score,
           RANK() OVER (ORDER BY score DESC) AS rank
    FROM student;
"""
df_rank_overall = pd.read_sql(query_rank_overall, conn)

#  X·∫øp h·∫°ng sinh vi√™n theo ƒëi·ªÉm s·ªë trong t·ª´ng l·ªõp
query_rank_class = """
    SELECT student_id, name, class, course_id, score,
           RANK() OVER (PARTITION BY class ORDER BY score DESC) AS rank
    FROM student;
"""
df_rank_class = pd.read_sql(query_rank_class, conn)

#  X·∫øp h·∫°ng sinh vi√™n theo ƒëi·ªÉm s·ªë trong t·ª´ng m√¥n h·ªçc
query_rank_course = """
    SELECT student_id, name, class, course_id, score,
           RANK() OVER (PARTITION BY course_id ORDER BY score DESC) AS rank
    FROM student;
"""
df_rank_course = pd.read_sql(query_rank_course, conn)

#  L·∫•y top 3 sinh vi√™n cao nh·∫•t & th·∫•p nh·∫•t theo t·ª´ng tr∆∞·ªùng h·ª£p
print(" Top 3 sinh vi√™n cao nh·∫•t theo to√†n b·ªô ƒëi·ªÉm s·ªë:")
print(df_rank_overall.head(3))  # 3 ng∆∞·ªùi c√≥ rank cao nh·∫•t

print("\n Top 3 sinh vi√™n th·∫•p nh·∫•t theo to√†n b·ªô ƒëi·ªÉm s·ªë:")
print(df_rank_overall.tail(3))  # 3 ng∆∞·ªùi c√≥ rank th·∫•p nh·∫•t

print("\n Top 3 sinh vi√™n cao nh·∫•t theo t·ª´ng l·ªõp:")
print(df_rank_class[df_rank_class["rank"] <= 3])

print("\n Top 3 sinh vi√™n th·∫•p nh·∫•t theo t·ª´ng l·ªõp:")
print(df_rank_class.groupby("class").tail(3))  # L·∫•y cu·ªëi 3 ng∆∞·ªùi trong m·ªói l·ªõp


# ƒê√≥ng k·∫øt n·ªëi
conn.close()

üîπ Top 3 sinh vi√™n cao nh·∫•t theo to√†n b·ªô ƒëi·ªÉm s·ªë:
   student_id           name     class  course_id  score  rank
0           2   Tran Thi Lan   Kinh Te         34    9.2     1
1           7  Bui Tien Dung   Kinh Te         34    9.2     1
2           3   Pham Van Nam  Toan Tin         34    7.9     3

üîπ Top 3 sinh vi√™n th·∫•p nh·∫•t theo to√†n b·ªô ƒëi·ªÉm s·ªë:
   student_id               name     class  course_id  score  rank
3           9     Duong Huu Phuc   Kinh Te         34    7.2     4
4          10       Cao Thi Hanh  May Tinh         34    7.0     5
5           1  Nguyen Minh Hoang  May Tinh         12    6.7     6

üîπ Top 3 sinh vi√™n cao nh·∫•t theo t·ª´ng l·ªõp:
   student_id               name     class  course_id  score  rank
0           2       Tran Thi Lan   Kinh Te         34    9.2     1
1           7      Bui Tien Dung   Kinh Te         34    9.2     1
2           9     Duong Huu Phuc   Kinh Te         34    7.2     3
3          10       Cao Thi Hanh  May Tinh         34    7.0     1
4           1  Nguyen Minh Hoang  May Tinh         12    6.7     2
5           3       Pham Van Nam  Toan Tin         34    7.9     1

üîπ Top 3 sinh vi√™n th·∫•p nh·∫•t theo t·ª´ng l·ªõp:
   student_id               name     class  course_id  score  rank
0           2       Tran Thi Lan   Kinh Te         34    9.2     1
1           7      Bui Tien Dung   Kinh Te         34    9.2     1
2           9     Duong Huu Phuc   Kinh Te         34    7.2     3
3          10       Cao Thi Hanh  May Tinh         34    7.0     1
4           1  Nguyen Minh Hoang  May Tinh         12    6.7     2
5           3       Pham Van Nam  Toan Tin         34    7.9     1

In [10]:
print("\nüîπ Top 3 sinh vi√™n cao nh·∫•t theo t·ª´ng m√¥n h·ªçc:")
print(df_rank_course[df_rank_course["rank"] <= 3])

print("\nüîπ Top 3 sinh vi√™n th·∫•p nh·∫•t theo t·ª´ng m√¥n h·ªçc:")
print(df_rank_course.groupby("course_id").tail(3))  # L·∫•y cu·ªëi 3 ng∆∞·ªùi trong m·ªói m√¥n h·ªçc

# ƒê√≥ng k·∫øt n·ªëi
conn.close()

üîπ Top 3 sinh vi√™n cao nh·∫•t theo t·ª´ng m√¥n h·ªçc:
   student_id               name     class  course_id  score  rank
0           1  Nguyen Minh Hoang  May Tinh         12    6.7     1
1           2       Tran Thi Lan   Kinh Te         34    9.2     1
2           7      Bui Tien Dung   Kinh Te         34    9.2     1
3           3       Pham Van Nam  Toan Tin         34    7.9     3

üîπ Top 3 sinh vi√™n th·∫•p nh·∫•t theo t·ª´ng m√¥n h·ªçc:
   student_id               name     class  course_id  score  rank
0           1  Nguyen Minh Hoang  May Tinh         12    6.7     1
3           3       Pham Van Nam  Toan Tin         34    7.9     3
4           9     Duong Huu Phuc   Kinh Te         34    7.2     4
5          10       Cao Thi Hanh  May Tinh         34    7.0     5

### 4

In [12]:
import sqlite3
import pandas as pd
from datetime import datetime, timedelta

# K·∫øt n·ªëi ƒë·∫øn SQLite
conn = sqlite3.connect("school.db")
cursor = conn.cursor()

# üü¢ Th√™m c·ªôt graduation_date v√†o b·∫£ng student n·∫øu ch∆∞a c√≥
cursor.execute("""
    ALTER TABLE student ADD COLUMN graduation_date DATETIME;
""")

# üü¢ C·∫≠p nh·∫≠t gi√° tr·ªã graduation_date d·ª±a tr√™n ƒëi·ªÉm s·ªë
current_date = datetime.now().strftime("%Y-%m-%d")  # L·∫•y ng√†y hi·ªán t·∫°i

cursor.execute("""
    UPDATE student
    SET graduation_date = 
        CASE 
            WHEN score >= 9.0 THEN DATE('now', '+3 months')
            WHEN score >= 6.0 THEN DATE('now', '+6 months')
            ELSE DATE('now', '+12 months')
        END;
""")

conn.commit()  # L∆∞u thay ƒë·ªïi

# üü¢ Hi·ªÉn th·ªã danh s√°ch sinh vi√™n sau khi c·∫≠p nh·∫≠t
df_students = pd.read_sql("SELECT * FROM student;", conn)
print("üîπ Danh s√°ch sinh vi√™n sau khi c·∫≠p nh·∫≠t th·ªùi gian t·ªët nghi·ªáp:")
print(df_students.to_string())

# ƒê√≥ng k·∫øt n·ªëi
conn.close()

üîπ Danh s√°ch sinh vi√™n sau khi c·∫≠p nh·∫≠t th·ªùi gian t·ªët nghi·ªáp:
   student_id               name     class  course_id  score graduation_date
0           1  Nguyen Minh Hoang  May Tinh         12    6.7      2025-09-12
1           2       Tran Thi Lan   Kinh Te         34    9.2      2025-06-12
2           3       Pham Van Nam  Toan Tin         34    7.9      2025-09-12
3           7      Bui Tien Dung   Kinh Te         34    9.2      2025-06-12
4           9     Duong Huu Phuc   Kinh Te         34    7.2      2025-09-12
5          10       Cao Thi Hanh  May Tinh         34    7.0      2025-09-12